import pickle

# Данные: страны и численность населения по десятилетиям
# Используем ключи: 1960, 1970, 1980, 1990, 2000, 2010
countries = {
    'Россия': {1960: 119000000, 1970: 130000000, 1980: 138000000, 1990: 147000000, 2000: 146000000, 2010: 142000000},
    'США': {1960: 180000000, 1970: 205000000, 1980: 227000000, 1990: 249000000, 2000: 282000000, 2010: 309000000},
    'Китай': {1960: 667000000, 1970: 818000000, 1980: 981000000, 1990: 1135000000, 2000: 1260000000, 2010: 1340000000},
    'Германия': {1960: 73000000, 1970: 78000000, 1980: 78000000, 1990: 79000000, 2000: 82000000, 2010: 81000000},
    'Япония': {1960: 94000000, 1970: 104000000, 1980: 117000000, 1990: 123000000, 2000: 126000000, 2010: 128000000},
    'Бразилия': {1960: 72000000, 1970: 96000000, 1980: 121000000, 1990: 149000000, 2000: 174000000, 2010: 196000000},
    'Италия': {1960: 50000000, 1970: 54000000, 1980: 56000000, 1990: 57000000, 2000: 57000000, 2010: 60000000},
}

# 1. Вывести список стран и среднюю численность населения
print("Средняя численность населения за 6 десятилетий:")
for country, data in countries.items():
    avg_pop = sum(data.values()) / len(data)
    print(f"{country}: {avg_pop:.0f}")

print()

# 2. Для каждой страны определить десятилетие с макс и мин населением
print("Десятилетия с максимальной и минимальной численностью населения:")
for country, data in countries.items():
    max_decade = max(data, key=data.get)
    min_decade = min(data, key=data.get)
    print(f"{country}: max - {max_decade} ({data[max_decade]}), min - {min_decade} ({data[min_decade]})")

print()

# 3. Выделить страны, у которых максимальная численность была в 1990-е
print("Страны с максимальным населением в 1990-е:")
for country, data in countries.items():
    max_decade = max(data, key=data.get)
    if max_decade == 1990:
        print(country)

print()

# 4. Выделить страны, где наблюдается снижение населения более чем на 10%
print("Страны с снижением численности населения более чем на 10%:")
for country, data in countries.items():
    pop_start = data[min(data.keys())]   # население в 1960
    pop_end = data[max(data.keys())]     # население в 2010
    if pop_end < pop_start * 0.9:
        print(country)

# Сохраняем в бинарный файл
with open('data.pickle', 'wb') as f:
    pickle.dump(countries, f)

# Для проверки считываем из файла
with open('data.pickle', 'rb') as f:
    loaded = pickle.load(f)

print("\nДанные успешно загружены из файла:")
for c in loaded:
    print(c, loaded[c])
